---
kind: other
id: Properties.T:Autodesk.Revit.DB.Lighting.InitialColor
source: html/4fb458e0-f3f2-c6c0-2540-472e34da624e.htm
---
# InitialColor Properties

Specifies whether the .NET object represents a valid Revit entity.